#+title: Uber using only Postgres

** Database

Let's first create our database. Let's call our application RIDER.

#+begin_src sql
	CREATE DATABASE RIDER;
#+end_src

#+RESULTS:
| CREATE DATABASE |
|-----------------|

#+begin_src sql
\c rider
#+end_src

#+RESULTS:
|---|

*** Customer/clients


#+begin_src sql :database rider
CREATE ROLE customer NOLOGIN NOSUPERUSER NOCREATEDB NOCREATEROLE NOBYPASSRLS;
#+end_src

#+RESULTS:
| CREATE ROLE |
|-------------|


- Create a customer

#+begin_src sql :database rider
	CREATE USER gustavokishima IN ROLE customer;
#+end_src

#+begin_src sql :database rider :dbuser gustavokishima :dbpassword 123
\du
#+end_src

#+RESULTS:
| usename        | usesysid | usecreatedb | usesuper | userepl | usebypassrls | passwd   | valuntil | useconfig |
|----------------+----------+-------------+----------+---------+--------------+----------+----------+-----------|
| postgres       |       10 | t           | t        | t       | t            | ******** |          |           |
| gustavokishima |    16390 | f           | f        | f       | f            | ******** |          |           |


** Roles and users

We can't use *pg_roles* as a reference to a table, because it is a
view. The table that *pg_roles* is derived from is *pg_authid*,
however, this is a *pg_catalog* table, which cannot be referenced.

To circumvent that, we will use a trigger and table.


- *Table for all customers*

  We need to create a table for that first due to SQL limitations. The
  query below does that, and gives us only the customers.

  #+begin_src sql :database rider
  DROP TABLE customers;
  CREATE TABLE customers AS
  SELECT r.rolname AS username
  FROM   pg_catalog.pg_roles r
	 LEFT JOIN pg_catalog.pg_auth_members m
		ON ( m.member = r.oid )
	 LEFT JOIN pg_roles r1
		ON ( m.roleid = r1.oid )
  WHERE  r.rolcanlogin
	 AND r1.rolname = 'customer'
  ORDER  BY 1; 
  #+end_src

  #+RESULTS:
  | DROP TABLE |
  |------------|
  | SELECT 3   |

#+begin_src sql :database rider
	select * from customers;
#+end_src

#+RESULTS:
| username       |
|----------------|
| gustavokishima |
| ricardokishima |
| tamireslemos   |

  But also, we need a way to update that. This can be done with a trigger.
  - *WIP*
    #+begin_src sql :database rider
	    -- WIP How can this update the `customers` table that was created?
    CREATE OR REPLACE FUNCTION upsert_customer_from_pg_roles()
    RETURNS trigger AS $upsert_customer$
    BEGIN
    INSERT INTO customers (username)
	   VALUES         (new.rolname)
    RETURN NEW;
    END;
    $upsert_customer$

    CREATE OR REPLACE TRIGGER update_customer
     AFTER INSERT ON pg_roles
     FOR EACH ROW
     WHEN (pg_catalog.pg_roles r
	   LEFT JOIN pg_catalog.pg_auth_members m
		  ON ( m.member = r.oid )
	   LEFT JOIN pg_roles r1
		  ON ( m.roleid = r1.oid )
    WHERE  r.rolcanlogin
	   AND r1.rolname = 'customer')
  #+end_src


  #+begin_src sql :database rider
    SELECT r.rolname AS username
    FROM   pg_catalog.pg_roles r
	   LEFT JOIN pg_catalog.pg_auth_members m
		  ON ( m.member = r.oid )
	   LEFT JOIN pg_roles r1
		  ON ( m.roleid = r1.oid )
    WHERE  r.rolcanlogin
	   AND r1.rolname = 'customer';
  #+end_src

  #+RESULTS:
  | username       |
  |----------------|
  | gustavokishima |
  | ricardokishima |
  | tamireslemos   |


** Ride
We will use the Postgis extension for location related stuff, so we
have to install it.

#+begin_src sql :database rider
CREATE EXTENSION IF NOT EXISTS postgis;

CREATE TABLE RIDE (
       id bigint      generated always as identity,
       customer       pg_user references pg_authid (rolname),
       driver         pg_user references pg_authid (rolname),
       start_location geography(Point),
       destination    geography(Point),
       ts             timestamptz,
       start_time     timestamptz,
       end_time       timestamptz,
       cost           numeric
       );
#+end_src

#+RESULTS:
| CREATE EXTENSION |
|------------------|

